Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13123.h
// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x10C);
#ifndef _LIB_BUILD
asm("PMD0 equ 010Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMMD                  :1;
        unsigned CRCMD                  :1;
        unsigned SCANMD                 :1;
        unsigned SYSCMD                 :1;
        unsigned                        :1;
        unsigned IOCMD                  :1;
        unsigned                        :1;
        unsigned TMR0MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x10C);
// bitfield macros
#define _PMD0_NVMMD_POSN                                    0x0
#define _PMD0_NVMMD_POSITION                                0x0
#define _PMD0_NVMMD_SIZE                                    0x1
#define _PMD0_NVMMD_LENGTH                                  0x1
#define _PMD0_NVMMD_MASK                                    0x1
#define _PMD0_CRCMD_POSN                                    0x1
#define _PMD0_CRCMD_POSITION                                0x1
#define _PMD0_CRCMD_SIZE                                    0x1
#define _PMD0_CRCMD_LENGTH                                  0x1
#define _PMD0_CRCMD_MASK                                    0x2
#define _PMD0_SCANMD_POSN                                   0x2
#define _PMD0_SCANMD_POSITION                               0x2
#define _PMD0_SCANMD_SIZE                                   0x1
#define _PMD0_SCANMD_LENGTH                                 0x1
#define _PMD0_SCANMD_MASK                                   0x4
#define _PMD0_SYSCMD_POSN                                   0x3
#define _PMD0_SYSCMD_POSITION                               0x3
#define _PMD0_SYSCMD_SIZE                                   0x1
#define _PMD0_SYSCMD_LENGTH                                 0x1
#define _PMD0_SYSCMD_MASK                                   0x8
#define _PMD0_IOCMD_POSN                                    0x5
#define _PMD0_IOCMD_POSITION                                0x5
#define _PMD0_IOCMD_SIZE                                    0x1
#define _PMD0_IOCMD_LENGTH                                  0x1
#define _PMD0_IOCMD_MASK                                    0x20
#define _PMD0_TMR0MD_POSN                                   0x7
#define _PMD0_TMR0MD_POSITION                               0x7
#define _PMD0_TMR0MD_SIZE                                   0x1
#define _PMD0_TMR0MD_LENGTH                                 0x1
#define _PMD0_TMR0MD_MASK                                   0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x10D);
#ifndef _LIB_BUILD
asm("PMD1 equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1MD                 :1;
        unsigned                        :1;
        unsigned TMR2MD                 :1;
        unsigned                        :2;
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0x10D);
// bitfield macros
#define _PMD1_TMR1MD_POSN                                   0x0
#define _PMD1_TMR1MD_POSITION                               0x0
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x1
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_CCP1MD_POSN                                   0x5
#define _PMD1_CCP1MD_POSITION                               0x5
#define _PMD1_CCP1MD_SIZE                                   0x1
#define _PMD1_CCP1MD_LENGTH                                 0x1
#define _PMD1_CCP1MD_MASK                                   0x20
#define _PMD1_CCP2MD_POSN                                   0x6
#define _PMD1_CCP2MD_POSITION                               0x6
#define _PMD1_CCP2MD_SIZE                                   0x1
#define _PMD1_CCP2MD_LENGTH                                 0x1
#define _PMD1_CCP2MD_MASK                                   0x40

// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0x10E);
#ifndef _LIB_BUILD
asm("PMD2 equ 010Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CLC1MD                 :1;
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0x10E);
// bitfield macros
#define _PMD2_CLC1MD_POSN                                   0x5
#define _PMD2_CLC1MD_POSITION                               0x5
#define _PMD2_CLC1MD_SIZE                                   0x1
#define _PMD2_CLC1MD_LENGTH                                 0x1
#define _PMD2_CLC1MD_MASK                                   0x20
#define _PMD2_CLC2MD_POSN                                   0x6
#define _PMD2_CLC2MD_POSITION                               0x6
#define _PMD2_CLC2MD_SIZE                                   0x1
#define _PMD2_CLC2MD_LENGTH                                 0x1
#define _PMD2_CLC2MD_MASK                                   0x40
#define _PMD2_CLC3MD_POSN                                   0x7
#define _PMD2_CLC3MD_POSITION                               0x7
#define _PMD2_CLC3MD_SIZE                                   0x1
#define _PMD2_CLC3MD_LENGTH                                 0x1
#define _PMD2_CLC3MD_MASK                                   0x80

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x10F);
#ifndef _LIB_BUILD
asm("PMD3 equ 010Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC4MD                 :1;
        unsigned UART1MD                :1;
        unsigned                        :1;
        unsigned MSSP1MD                :1;
        unsigned                        :1;
        unsigned FVRMD                  :1;
        unsigned CM1MD                  :1;
        unsigned CM2MD                  :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x10F);
// bitfield macros
#define _PMD3_CLC4MD_POSN                                   0x0
#define _PMD3_CLC4MD_POSITION                               0x0
#define _PMD3_CLC4MD_SIZE                                   0x1
#define _PMD3_CLC4MD_LENGTH                                 0x1
#define _PMD3_CLC4MD_MASK                                   0x1
#define _PMD3_UART1MD_POSN                                  0x1
#define _PMD3_UART1MD_POSITION                              0x1
#define _PMD3_UART1MD_SIZE                                  0x1
#define _PMD3_UART1MD_LENGTH                                0x1
#define _PMD3_UART1MD_MASK                                  0x2
#define _PMD3_MSSP1MD_POSN                                  0x3
#define _PMD3_MSSP1MD_POSITION                              0x3
#define _PMD3_MSSP1MD_SIZE                                  0x1
#define _PMD3_MSSP1MD_LENGTH                                0x1
#define _PMD3_MSSP1MD_MASK                                  0x8
#define _PMD3_FVRMD_POSN                                    0x5
#define _PMD3_FVRMD_POSITION                                0x5
#define _PMD3_FVRMD_SIZE                                    0x1
#define _PMD3_FVRMD_LENGTH                                  0x1
#define _PMD3_FVRMD_MASK                                    0x20
#define _PMD3_CM1MD_POSN                                    0x6
#define _PMD3_CM1MD_POSITION                                0x6
#define _PMD3_CM1MD_SIZE                                    0x1
#define _PMD3_CM1MD_LENGTH                                  0x1
#define _PMD3_CM1MD_MASK                                    0x40
#define _PMD3_CM2MD_POSN                                    0x7
#define _PMD3_CM2MD_POSITION                                0x7
#define _PMD3_CM2MD_SIZE                                    0x1
#define _PMD3_CM2MD_LENGTH                                  0x1
#define _PMD3_CM2MD_MASK                                    0x80

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x110);
#ifndef _LIB_BUILD
asm("PMD4 equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCMD                  :1;
        unsigned DAC1MD                 :1;
        unsigned                        :5;
        unsigned CLBMD                  :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0x110);
// bitfield macros
#define _PMD4_ADCMD_POSN                                    0x0
#define _PMD4_ADCMD_POSITION                                0x0
#define _PMD4_ADCMD_SIZE                                    0x1
#define _PMD4_ADCMD_LENGTH                                  0x1
#define _PMD4_ADCMD_MASK                                    0x1
#define _PMD4_DAC1MD_POSN                                   0x1
#define _PMD4_DAC1MD_POSITION                               0x1
#define _PMD4_DAC1MD_SIZE                                   0x1
#define _PMD4_DAC1MD_LENGTH                                 0x1
#define _PMD4_DAC1MD_MASK                                   0x2
#define _PMD4_CLBMD_POSN                                    0x7
#define _PMD4_CLBMD_POSITION                                0x7
#define _PMD4_CLBMD_SIZE                                    0x1
#define _PMD4_CLBMD_LENGTH                                  0x1
#define _PMD4_CLBMD_MASK                                    0x80

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0x111);
#ifndef _LIB_BUILD
asm("PMD5 equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1MD                 :1;
        unsigned PWM2MD                 :1;
    };
} PMD5bits_t;
extern volatile PMD5bits_t PMD5bits __at(0x111);
// bitfield macros
#define _PMD5_PWM1MD_POSN                                   0x0
#define _PMD5_PWM1MD_POSITION                               0x0
#define _PMD5_PWM1MD_SIZE                                   0x1
#define _PMD5_PWM1MD_LENGTH                                 0x1
#define _PMD5_PWM1MD_MASK                                   0x1
#define _PMD5_PWM2MD_POSN                                   0x1
#define _PMD5_PWM2MD_POSITION                               0x1
#define _PMD5_PWM2MD_SIZE                                   0x1
#define _PMD5_PWM2MD_LENGTH                                 0x1
#define _PMD5_PWM2MD_MASK                                   0x2

// Register: WDTCON0
#define WDTCON0 WDTCON0
extern volatile unsigned char           WDTCON0             __at(0x18C);
#ifndef _LIB_BUILD
asm("WDTCON0 equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEN                    :1;
        unsigned PS                     :5;
    };
    struct {
        unsigned SWDTEN                 :1;
        unsigned WDTPS                  :5;
    };
    struct {
        unsigned WDTSEN                 :1;
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
        unsigned PS3                    :1;
        unsigned PS4                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned WDTPS0                 :1;
        unsigned WDTPS1                 :1;
        unsigned WDTPS2                 :1;
        unsigned WDTPS3                 :1;
        unsigned WDTPS4                 :1;
    };
} WDTCON0bits_t;
extern volatile WDTCON0bits_t WDTCON0bits __at(0x18C);
// bitfield macros
#define _WDTCON0_SEN_POSN                                   0x0
#define _WDTCON0_SEN_POSITION                               0x0
#define _WDTCON0_SEN_SIZE                                   0x1
#define _WDTCON0_SEN_LENGTH                                 0x1
#define _WDTCON0_SEN_MASK                                   0x1
#define _WDTCON0_PS_POSN                                    0x1
#define _WDTCON0_PS_POSITION                                0x1
#define _WDTCON0_PS_SIZE                                    0x5
#define _WDTCON0_PS_LENGTH                                  0x5
#define _WDTCON0_PS_MASK                                    0x3E
#define _WDTCON0_SWDTEN_POSN                                0x0
#define _WDTCON0_SWDTEN_POSITION                            0x0
#define _WDTCON0_SWDTEN_SIZE                                0x1
#define _WDTCON0_SWDTEN_LENGTH                              0x1
#define _WDTCON0_SWDTEN_MASK                                0x1
#define _WDTCON0_WDTPS_POSN                                 0x1
#define _WDTCON0_WDTPS_POSITION                             0x1
#define _WDTCON0_WDTPS_SIZE                                 0x5
#define _WDTCON0_WDTPS_LENGTH                               0x5
#define _WDTCON0_WDTPS_MASK                                 0x3E
#define _WDTCON0_WDTSEN_POSN                                0x0
#define _WDTCON0_WDTSEN_POSITION                            0x0
#define _WDTCON0_WDTSEN_SIZE                                0x1
#define _WDTCON0_WDTSEN_LENGTH                              0x1
#define _WDTCON0_WDTSEN_MASK                                0x1
#define _WDTCON0_PS0_POSN                                   0x1
#define _WDTCON0_PS0_POSITION                               0x1
#define _WDTCON0_PS0_SIZE                                   0x1
#define _WDTCON0_PS0_LENGTH                                 0x1
#define _WDTCON0_PS0_MASK                                   0x2
#define _WDTCON0_PS1_POSN                                   0x2
#define _WDTCON0_PS1_POSITION                               0x2
#define _WDTCON0_PS1_SIZE                                   0x1
#define _WDTCON0_PS1_LENGTH                                 0x1
#define _WDTCON0_PS1_MASK                                   0x4
#define _WDTCON0_PS2_POSN                                   0x3
#define _WDTCON0_PS2_POSITION                               0x3
#define _WDTCON0_PS2_SIZE                                   0x1
#define _WDTCON0_PS2_LENGTH                                 0x1
#define _WDTCON0_PS2_MASK                                   0x8
#define _WDTCON0_PS3_POSN                                   0x4
#define _WDTCON0_PS3_POSITION                               0x4
#define _WDTCON0_PS3_SIZE                                   0x1
#define _WDTCON0_PS3_LENGTH                                 0x1
#define _WDTCON0_PS3_MASK                                   0x10
#define _WDTCON0_PS4_POSN                                   0x5
#define _WDTCON0_PS4_POSITION                               0x5
#define _WDTCON0_PS4_SIZE                                   0x1
#define _WDTCON0_PS4_LENGTH                                 0x1
#define _WDTCON0_PS4_MASK                                   0x20
#define _WDTCON0_WDTPS0_POSN                                0x1
#define _WDTCON0_WDTPS0_POSITION                            0x1
#define _WDTCON0_WDTPS0_SIZE                                0x1
#define _WDTCON0_WDTPS0_LENGTH                              0x1
#define _WDTCON0_WDTPS0_MASK                                0x2
#define _WDTCON0_WDTPS1_POSN                                0x2
#define _WDTCON0_WDTPS1_POSITION                            0x2
#define _WDTCON0_WDTPS1_SIZE                                0x1
#define _WDTCON0_WDTPS1_LENGTH                              0x1
#define _WDTCON0_WDTPS1_MASK                                0x4
#define _WDTCON0_WDTPS2_POSN                                0x3
#define _WDTCON0_WDTPS2_POSITION                            0x3
#define _WDTCON0_WDTPS2_SIZE                                0x1
#define _WDTCON0_WDTPS2_LENGTH                              0x1
#define _WDTCON0_WDTPS2_MASK                                0x8
#define _WDTCON0_WDTPS3_POSN                                0x4
#define _WDTCON0_WDTPS3_POSITION                            0x4
#define _WDTCON0_WDTPS3_SIZE                                0x1
#define _WDTCON0_WDTPS3_LENGTH                              0x1
#define _WDTCON0_WDTPS3_MASK                                0x10
#define _WDTCON0_WDTPS4_POSN                                0x5
#define _WDTCON0_WDTPS4_POSITION                            0x5
#define _WDTCON0_WDTPS4_SIZE                                0x1
#define _WDTCON0_WDTPS4_LENGTH                              0x1
#define _WDTCON0_WDTPS4_MASK                                0x20

// Register: WDTCON1
#define WDTCON1 WDTCON1
extern volatile unsigned char           WDTCON1             __at(0x18D);
#ifndef _LIB_BUILD
asm("WDTCON1 equ 018Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WINDOW                 :3;
        unsigned                        :1;
        unsigned CS                     :3;
    };
    struct {
        unsigned WINDOW0                :1;
        unsigned WINDOW1                :1;
        unsigned WINDOW2                :1;
        unsigned                        :1;
        unsigned WDTCS                  :3;
    };
    struct {
        unsigned WDTWINDOW              :3;
        unsigned                        :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
    };
    struct {
        unsigned WDTWINDOW0             :1;
        unsigned WDTWINDOW1             :1;
        unsigned WDTWINDOW2             :1;
        unsigned                        :1;
        unsigned WDTCS0                 :1;
        unsigned WDTCS1                 :1;
        unsigned WDTCS2                 :1;
    };
} WDTCON1bits_t;
extern volatile WDTCON1bits_t WDTCON1bits __at(0x18D);
// bitfield macros
#define _WDTCON1_WINDOW_POSN                                0x0
#define _WDTCON1_WINDOW_POSITION                            0x0
#define _WDTCON1_WINDOW_SIZE                                0x3
#define _WDTCON1_WINDOW_LENGTH                              0x3
#define _WDTCON1_WINDOW_MASK                                0x7
#define _WDTCON1_CS_POSN                                    0x4
#define _WDTCON1_CS_POSITION                                0x4
#define _WDTCON1_CS_SIZE                                    0x3
#define _WDTCON1_CS_LENGTH                                  0x3
#define _WDTCON1_CS_MASK                                    0x70
#define _WDTCON1_WINDOW0_POSN                               0x0
#define _WDTCON1_WINDOW0_POSITION                           0x0
#define _WDTCON1_WINDOW0_SIZE                               0x1
#define _WDTCON1_WINDOW0_LENGTH                             0x1
#define _WDTCON1_WINDOW0_MASK                               0x1
#define _WDTCON1_WINDOW1_POSN                               0x1
#define _WDTCON1_WINDOW1_POSITION                           0x1
#define _WDTCON1_WINDOW1_SIZE                               0x1
#define _WDTCON1_WINDOW1_LENGTH                             0x1
#define _WDTCON1_WINDOW1_MASK                               0x2
#define _WDTCON1_WINDOW2_POSN                               0x2
#define _WDTCON1_WINDOW2_POSITION                           0x2
#define _WDTCON1_WINDOW2_SIZE                               0x1
#define _WDTCON1_WINDOW2_LENGTH                             0x1
#define _WDTCON1_WINDOW2_MASK                               0x4
#define _WDTCON1_WDTCS_POSN                                 0x4
#define _WDTCON1_WDTCS_POSITION                             0x4
#define _WDTCON1_WDTCS_SIZE                                 0x3
#define _WDTCON1_WDTCS_LENGTH                               0x3
#define _WDTCON1_WDTCS_MASK                                 0x70
#define _WDTCON1_WDTWINDOW_POSN                             0x0
#define _WDTCON1_WDTWINDOW_POSITION                         0x0
#define _WDTCON1_WDTWINDOW_SIZE                             0x3
#define _WDTCON1_WDTWINDOW_LENGTH                           0x3
#define _WDTCON1_WDTWINDOW_MASK                             0x7
#define _WDTCON1_CS0_POSN                                   0x4
#define _WDTCON1_CS0_POSITION                               0x4
#define _WDTCON1_CS0_SIZE                                   0x1
#define _WDTCON1_CS0_LENGTH                                 0x1
#define _WDTCON1_CS0_MASK                                   0x10
#define _WDTCON1_CS1_POSN                                   0x5
#define _WDTCON1_CS1_POSITION                               0x5
#define _WDTCON1_CS1_SIZE                                   0x1
#define _WDTCON1_CS1_LENGTH                                 0x1
#define _WDTCON1_CS1_MASK                                   0x20
#define _WDTCON1_CS2_POSN                                   0x6
#define _WDTCON1_CS2_POSITION                               0x6
#define _WDTCON1_CS2_SIZE                                   0x1
#define _WDTCON1_CS2_LENGTH                                 0x1
#define _WDTCON1_CS2_MASK                                   0x40
#define _WDTCON1_WDTWINDOW0_POSN                            0x0
#define _WDTCON1_WDTWINDOW0_POSITION                        0x0
#define _WDTCON1_WDTWINDOW0_SIZE                            0x1
#define _WDTCON1_WDTWINDOW0_LENGTH                          0x1
#define _WDTCON1_WDTWINDOW0_MASK                            0x1
#define _WDTCON1_WDTWINDOW1_POSN                            0x1
#define _WDTCON1_WDTWINDOW1_POSITION                        0x1
#define _WDTCON1_WDTWINDOW1_SIZE                            0x1
#define _WDTCON1_WDTWINDOW1_LENGTH                          0x1
#define _WDTCON1_WDTWINDOW1_MASK                            0x2
#define _WDTCON1_WDTWINDOW2_POSN                            0x2
#define _WDTCON1_WDTWINDOW2_POSITION                        0x2
#define _WDTCON1_WDTWINDOW2_SIZE                            0x1
#define _WDTCON1_WDTWINDOW2_LENGTH                          0x1
#define _WDTCON1_WDTWINDOW2_MASK                            0x4
#define _WDTCON1_WDTCS0_POSN                                0x4
#define _WDTCON1_WDTCS0_POSITION                            0x4
#define _WDTCON1_WDTCS0_SIZE                                0x1
#define _WDTCON1_WDTCS0_LENGTH                              0x1
#define _WDTCON1_WDTCS0_MASK                                0x10
#define _WDTCON1_WDTCS1_POSN                                0x5
#define _WDTCON1_WDTCS1_POSITION                            0x5
#define _WDTCON1_WDTCS1_SIZE                                0x1
#define _WDTCON1_WDTCS1_LENGTH                              0x1
#define _WDTCON1_WDTCS1_MASK                                0x20
#define _WDTCON1_WDTCS2_POSN                                0x6
#define _WDTCON1_WDTCS2_POSITION                            0x6
#define _WDTCON1_WDTCS2_SIZE                                0x1
#define _WDTCON1_WDTCS2_LENGTH                              0x1
#define _WDTCON1_WDTCS2_MASK                                0x40

