Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13123.h
// Register: PWM1DC
#define PWM1DC PWM1DC
extern volatile unsigned short          PWM1DC              __at(0x820);
#ifndef _LIB_BUILD
asm("PWM1DC equ 0820h");
#endif

// Register: PWM1DCL
#define PWM1DCL PWM1DCL
extern volatile unsigned char           PWM1DCL             __at(0x820);
#ifndef _LIB_BUILD
asm("PWM1DCL equ 0820h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DCL                    :2;
    };
} PWM1DCLbits_t;
extern volatile PWM1DCLbits_t PWM1DCLbits __at(0x820);
// bitfield macros
#define _PWM1DCL_DCL_POSN                                   0x6
#define _PWM1DCL_DCL_POSITION                               0x6
#define _PWM1DCL_DCL_SIZE                                   0x2
#define _PWM1DCL_DCL_LENGTH                                 0x2
#define _PWM1DCL_DCL_MASK                                   0xC0

// Register: PWM1DCH
#define PWM1DCH PWM1DCH
extern volatile unsigned char           PWM1DCH             __at(0x821);
#ifndef _LIB_BUILD
asm("PWM1DCH equ 0821h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCH                    :8;
    };
} PWM1DCHbits_t;
extern volatile PWM1DCHbits_t PWM1DCHbits __at(0x821);
// bitfield macros
#define _PWM1DCH_DCH_POSN                                   0x0
#define _PWM1DCH_DCH_POSITION                               0x0
#define _PWM1DCH_DCH_SIZE                                   0x8
#define _PWM1DCH_DCH_LENGTH                                 0x8
#define _PWM1DCH_DCH_MASK                                   0xFF

// Register: PWM1CON
#define PWM1CON PWM1CON
extern volatile unsigned char           PWM1CON             __at(0x822);
#ifndef _LIB_BUILD
asm("PWM1CON equ 0822h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM1POL                :1;
        unsigned PWM1OUT                :1;
        unsigned                        :1;
        unsigned PWM1EN                 :1;
    };
} PWM1CONbits_t;
extern volatile PWM1CONbits_t PWM1CONbits __at(0x822);
// bitfield macros
#define _PWM1CON_POL_POSN                                   0x4
#define _PWM1CON_POL_POSITION                               0x4
#define _PWM1CON_POL_SIZE                                   0x1
#define _PWM1CON_POL_LENGTH                                 0x1
#define _PWM1CON_POL_MASK                                   0x10
#define _PWM1CON_OUT_POSN                                   0x5
#define _PWM1CON_OUT_POSITION                               0x5
#define _PWM1CON_OUT_SIZE                                   0x1
#define _PWM1CON_OUT_LENGTH                                 0x1
#define _PWM1CON_OUT_MASK                                   0x20
#define _PWM1CON_EN_POSN                                    0x7
#define _PWM1CON_EN_POSITION                                0x7
#define _PWM1CON_EN_SIZE                                    0x1
#define _PWM1CON_EN_LENGTH                                  0x1
#define _PWM1CON_EN_MASK                                    0x80
#define _PWM1CON_PWM1POL_POSN                               0x4
#define _PWM1CON_PWM1POL_POSITION                           0x4
#define _PWM1CON_PWM1POL_SIZE                               0x1
#define _PWM1CON_PWM1POL_LENGTH                             0x1
#define _PWM1CON_PWM1POL_MASK                               0x10
#define _PWM1CON_PWM1OUT_POSN                               0x5
#define _PWM1CON_PWM1OUT_POSITION                           0x5
#define _PWM1CON_PWM1OUT_SIZE                               0x1
#define _PWM1CON_PWM1OUT_LENGTH                             0x1
#define _PWM1CON_PWM1OUT_MASK                               0x20
#define _PWM1CON_PWM1EN_POSN                                0x7
#define _PWM1CON_PWM1EN_POSITION                            0x7
#define _PWM1CON_PWM1EN_SIZE                                0x1
#define _PWM1CON_PWM1EN_LENGTH                              0x1
#define _PWM1CON_PWM1EN_MASK                                0x80

// Register: PWM2DC
#define PWM2DC PWM2DC
extern volatile unsigned short          PWM2DC              __at(0x823);
#ifndef _LIB_BUILD
asm("PWM2DC equ 0823h");
#endif

// Register: PWM2DCL
#define PWM2DCL PWM2DCL
extern volatile unsigned char           PWM2DCL             __at(0x823);
#ifndef _LIB_BUILD
asm("PWM2DCL equ 0823h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DCL                    :2;
    };
} PWM2DCLbits_t;
extern volatile PWM2DCLbits_t PWM2DCLbits __at(0x823);
// bitfield macros
#define _PWM2DCL_DCL_POSN                                   0x6
#define _PWM2DCL_DCL_POSITION                               0x6
#define _PWM2DCL_DCL_SIZE                                   0x2
#define _PWM2DCL_DCL_LENGTH                                 0x2
#define _PWM2DCL_DCL_MASK                                   0xC0

// Register: PWM2DCH
#define PWM2DCH PWM2DCH
extern volatile unsigned char           PWM2DCH             __at(0x824);
#ifndef _LIB_BUILD
asm("PWM2DCH equ 0824h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCH                    :8;
    };
} PWM2DCHbits_t;
extern volatile PWM2DCHbits_t PWM2DCHbits __at(0x824);
// bitfield macros
#define _PWM2DCH_DCH_POSN                                   0x0
#define _PWM2DCH_DCH_POSITION                               0x0
#define _PWM2DCH_DCH_SIZE                                   0x8
#define _PWM2DCH_DCH_LENGTH                                 0x8
#define _PWM2DCH_DCH_MASK                                   0xFF

// Register: PWM2CON
#define PWM2CON PWM2CON
extern volatile unsigned char           PWM2CON             __at(0x825);
#ifndef _LIB_BUILD
asm("PWM2CON equ 0825h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM2POL                :1;
        unsigned PWM2OUT                :1;
        unsigned                        :1;
        unsigned PWM2EN                 :1;
    };
} PWM2CONbits_t;
extern volatile PWM2CONbits_t PWM2CONbits __at(0x825);
// bitfield macros
#define _PWM2CON_POL_POSN                                   0x4
#define _PWM2CON_POL_POSITION                               0x4
#define _PWM2CON_POL_SIZE                                   0x1
#define _PWM2CON_POL_LENGTH                                 0x1
#define _PWM2CON_POL_MASK                                   0x10
#define _PWM2CON_OUT_POSN                                   0x5
#define _PWM2CON_OUT_POSITION                               0x5
#define _PWM2CON_OUT_SIZE                                   0x1
#define _PWM2CON_OUT_LENGTH                                 0x1
#define _PWM2CON_OUT_MASK                                   0x20
#define _PWM2CON_EN_POSN                                    0x7
#define _PWM2CON_EN_POSITION                                0x7
#define _PWM2CON_EN_SIZE                                    0x1
#define _PWM2CON_EN_LENGTH                                  0x1
#define _PWM2CON_EN_MASK                                    0x80
#define _PWM2CON_PWM2POL_POSN                               0x4
#define _PWM2CON_PWM2POL_POSITION                           0x4
#define _PWM2CON_PWM2POL_SIZE                               0x1
#define _PWM2CON_PWM2POL_LENGTH                             0x1
#define _PWM2CON_PWM2POL_MASK                               0x10
#define _PWM2CON_PWM2OUT_POSN                               0x5
#define _PWM2CON_PWM2OUT_POSITION                           0x5
#define _PWM2CON_PWM2OUT_SIZE                               0x1
#define _PWM2CON_PWM2OUT_LENGTH                             0x1
#define _PWM2CON_PWM2OUT_MASK                               0x20
#define _PWM2CON_PWM2EN_POSN                                0x7
#define _PWM2CON_PWM2EN_POSITION                            0x7
#define _PWM2CON_PWM2EN_SIZE                                0x1
#define _PWM2CON_PWM2EN_LENGTH                              0x1
#define _PWM2CON_PWM2EN_MASK                                0x80

// Register: PWMTMRS0
#define PWMTMRS0 PWMTMRS0
extern volatile unsigned char           PWMTMRS0            __at(0x82F);
#ifndef _LIB_BUILD
asm("PWMTMRS0 equ 082Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1TSEL                 :2;
        unsigned P2TSEL                 :2;
    };
} PWMTMRS0bits_t;
extern volatile PWMTMRS0bits_t PWMTMRS0bits __at(0x82F);
// bitfield macros
#define _PWMTMRS0_P1TSEL_POSN                               0x0
#define _PWMTMRS0_P1TSEL_POSITION                           0x0
#define _PWMTMRS0_P1TSEL_SIZE                               0x2
#define _PWMTMRS0_P1TSEL_LENGTH                             0x2
#define _PWMTMRS0_P1TSEL_MASK                               0x3
#define _PWMTMRS0_P2TSEL_POSN                               0x2
#define _PWMTMRS0_P2TSEL_POSITION                           0x2
#define _PWMTMRS0_P2TSEL_SIZE                               0x2
#define _PWMTMRS0_P2TSEL_LENGTH                             0x2
#define _PWMTMRS0_P2TSEL_MASK                               0xC

