Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13123.h
// Register: CRCXORT
#define CRCXORT CRCXORT
extern volatile unsigned char           CRCXORT             __at(0x1CA4);
#ifndef _LIB_BUILD
asm("CRCXORT equ 01CA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XOR                    :8;
    };
    struct {
        unsigned XOR24                  :1;
        unsigned XOR25                  :1;
        unsigned XOR26                  :1;
        unsigned XOR27                  :1;
        unsigned XOR28                  :1;
        unsigned XOR29                  :1;
        unsigned XOR30                  :1;
        unsigned XOR31                  :1;
    };
} CRCXORTbits_t;
extern volatile CRCXORTbits_t CRCXORTbits __at(0x1CA4);
// bitfield macros
#define _CRCXORT_XOR_POSN                                   0x0
#define _CRCXORT_XOR_POSITION                               0x0
#define _CRCXORT_XOR_SIZE                                   0x8
#define _CRCXORT_XOR_LENGTH                                 0x8
#define _CRCXORT_XOR_MASK                                   0xFF
#define _CRCXORT_XOR24_POSN                                 0x0
#define _CRCXORT_XOR24_POSITION                             0x0
#define _CRCXORT_XOR24_SIZE                                 0x1
#define _CRCXORT_XOR24_LENGTH                               0x1
#define _CRCXORT_XOR24_MASK                                 0x1
#define _CRCXORT_XOR25_POSN                                 0x1
#define _CRCXORT_XOR25_POSITION                             0x1
#define _CRCXORT_XOR25_SIZE                                 0x1
#define _CRCXORT_XOR25_LENGTH                               0x1
#define _CRCXORT_XOR25_MASK                                 0x2
#define _CRCXORT_XOR26_POSN                                 0x2
#define _CRCXORT_XOR26_POSITION                             0x2
#define _CRCXORT_XOR26_SIZE                                 0x1
#define _CRCXORT_XOR26_LENGTH                               0x1
#define _CRCXORT_XOR26_MASK                                 0x4
#define _CRCXORT_XOR27_POSN                                 0x3
#define _CRCXORT_XOR27_POSITION                             0x3
#define _CRCXORT_XOR27_SIZE                                 0x1
#define _CRCXORT_XOR27_LENGTH                               0x1
#define _CRCXORT_XOR27_MASK                                 0x8
#define _CRCXORT_XOR28_POSN                                 0x4
#define _CRCXORT_XOR28_POSITION                             0x4
#define _CRCXORT_XOR28_SIZE                                 0x1
#define _CRCXORT_XOR28_LENGTH                               0x1
#define _CRCXORT_XOR28_MASK                                 0x10
#define _CRCXORT_XOR29_POSN                                 0x5
#define _CRCXORT_XOR29_POSITION                             0x5
#define _CRCXORT_XOR29_SIZE                                 0x1
#define _CRCXORT_XOR29_LENGTH                               0x1
#define _CRCXORT_XOR29_MASK                                 0x20
#define _CRCXORT_XOR30_POSN                                 0x6
#define _CRCXORT_XOR30_POSITION                             0x6
#define _CRCXORT_XOR30_SIZE                                 0x1
#define _CRCXORT_XOR30_LENGTH                               0x1
#define _CRCXORT_XOR30_MASK                                 0x40
#define _CRCXORT_XOR31_POSN                                 0x7
#define _CRCXORT_XOR31_POSITION                             0x7
#define _CRCXORT_XOR31_SIZE                                 0x1
#define _CRCXORT_XOR31_LENGTH                               0x1
#define _CRCXORT_XOR31_MASK                                 0x80

// Register: CRCCON0
#define CRCCON0 CRCCON0
extern volatile unsigned char           CRCCON0             __at(0x1CA5);
#ifndef _LIB_BUILD
asm("CRCCON0 equ 01CA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FULL                   :1;
        unsigned SHIFTM                 :1;
        unsigned SETUP                  :2;
        unsigned ACCMOD                 :1;
        unsigned CRCBUSY                :1;
        unsigned CRCGO                  :1;
        unsigned CRCEN                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned LENDIAN                :1;
        unsigned SETUP0                 :1;
        unsigned SETUP1                 :1;
        unsigned ACCM                   :1;
        unsigned BUSY                   :1;
        unsigned GO                     :1;
        unsigned EN                     :1;
    };
} CRCCON0bits_t;
extern volatile CRCCON0bits_t CRCCON0bits __at(0x1CA5);
// bitfield macros
#define _CRCCON0_FULL_POSN                                  0x0
#define _CRCCON0_FULL_POSITION                              0x0
#define _CRCCON0_FULL_SIZE                                  0x1
#define _CRCCON0_FULL_LENGTH                                0x1
#define _CRCCON0_FULL_MASK                                  0x1
#define _CRCCON0_SHIFTM_POSN                                0x1
#define _CRCCON0_SHIFTM_POSITION                            0x1
#define _CRCCON0_SHIFTM_SIZE                                0x1
#define _CRCCON0_SHIFTM_LENGTH                              0x1
#define _CRCCON0_SHIFTM_MASK                                0x2
#define _CRCCON0_SETUP_POSN                                 0x2
#define _CRCCON0_SETUP_POSITION                             0x2
#define _CRCCON0_SETUP_SIZE                                 0x2
#define _CRCCON0_SETUP_LENGTH                               0x2
#define _CRCCON0_SETUP_MASK                                 0xC
#define _CRCCON0_ACCMOD_POSN                                0x4
#define _CRCCON0_ACCMOD_POSITION                            0x4
#define _CRCCON0_ACCMOD_SIZE                                0x1
#define _CRCCON0_ACCMOD_LENGTH                              0x1
#define _CRCCON0_ACCMOD_MASK                                0x10
#define _CRCCON0_CRCBUSY_POSN                               0x5
#define _CRCCON0_CRCBUSY_POSITION                           0x5
#define _CRCCON0_CRCBUSY_SIZE                               0x1
#define _CRCCON0_CRCBUSY_LENGTH                             0x1
#define _CRCCON0_CRCBUSY_MASK                               0x20
#define _CRCCON0_CRCGO_POSN                                 0x6
#define _CRCCON0_CRCGO_POSITION                             0x6
#define _CRCCON0_CRCGO_SIZE                                 0x1
#define _CRCCON0_CRCGO_LENGTH                               0x1
#define _CRCCON0_CRCGO_MASK                                 0x40
#define _CRCCON0_CRCEN_POSN                                 0x7
#define _CRCCON0_CRCEN_POSITION                             0x7
#define _CRCCON0_CRCEN_SIZE                                 0x1
#define _CRCCON0_CRCEN_LENGTH                               0x1
#define _CRCCON0_CRCEN_MASK                                 0x80
#define _CRCCON0_LENDIAN_POSN                               0x1
#define _CRCCON0_LENDIAN_POSITION                           0x1
#define _CRCCON0_LENDIAN_SIZE                               0x1
#define _CRCCON0_LENDIAN_LENGTH                             0x1
#define _CRCCON0_LENDIAN_MASK                               0x2
#define _CRCCON0_SETUP0_POSN                                0x2
#define _CRCCON0_SETUP0_POSITION                            0x2
#define _CRCCON0_SETUP0_SIZE                                0x1
#define _CRCCON0_SETUP0_LENGTH                              0x1
#define _CRCCON0_SETUP0_MASK                                0x4
#define _CRCCON0_SETUP1_POSN                                0x3
#define _CRCCON0_SETUP1_POSITION                            0x3
#define _CRCCON0_SETUP1_SIZE                                0x1
#define _CRCCON0_SETUP1_LENGTH                              0x1
#define _CRCCON0_SETUP1_MASK                                0x8
#define _CRCCON0_ACCM_POSN                                  0x4
#define _CRCCON0_ACCM_POSITION                              0x4
#define _CRCCON0_ACCM_SIZE                                  0x1
#define _CRCCON0_ACCM_LENGTH                                0x1
#define _CRCCON0_ACCM_MASK                                  0x10
#define _CRCCON0_BUSY_POSN                                  0x5
#define _CRCCON0_BUSY_POSITION                              0x5
#define _CRCCON0_BUSY_SIZE                                  0x1
#define _CRCCON0_BUSY_LENGTH                                0x1
#define _CRCCON0_BUSY_MASK                                  0x20
#define _CRCCON0_GO_POSN                                    0x6
#define _CRCCON0_GO_POSITION                                0x6
#define _CRCCON0_GO_SIZE                                    0x1
#define _CRCCON0_GO_LENGTH                                  0x1
#define _CRCCON0_GO_MASK                                    0x40
#define _CRCCON0_EN_POSN                                    0x7
#define _CRCCON0_EN_POSITION                                0x7
#define _CRCCON0_EN_SIZE                                    0x1
#define _CRCCON0_EN_LENGTH                                  0x1
#define _CRCCON0_EN_MASK                                    0x80

