Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13123.h
// Register: CLBIN0PPS
#define CLBIN0PPS CLBIN0PPS
extern volatile unsigned char           CLBIN0PPS           __at(0x1E57);
#ifndef _LIB_BUILD
asm("CLBIN0PPS equ 01E57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN0PPS              :5;
    };
} CLBIN0PPSbits_t;
extern volatile CLBIN0PPSbits_t CLBIN0PPSbits __at(0x1E57);
// bitfield macros
#define _CLBIN0PPS_CLBIN0PPS_POSN                           0x0
#define _CLBIN0PPS_CLBIN0PPS_POSITION                       0x0
#define _CLBIN0PPS_CLBIN0PPS_SIZE                           0x5
#define _CLBIN0PPS_CLBIN0PPS_LENGTH                         0x5
#define _CLBIN0PPS_CLBIN0PPS_MASK                           0x1F

// Register: CLBIN1PPS
#define CLBIN1PPS CLBIN1PPS
extern volatile unsigned char           CLBIN1PPS           __at(0x1E58);
#ifndef _LIB_BUILD
asm("CLBIN1PPS equ 01E58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN1PPS              :5;
    };
} CLBIN1PPSbits_t;
extern volatile CLBIN1PPSbits_t CLBIN1PPSbits __at(0x1E58);
// bitfield macros
#define _CLBIN1PPS_CLBIN1PPS_POSN                           0x0
#define _CLBIN1PPS_CLBIN1PPS_POSITION                       0x0
#define _CLBIN1PPS_CLBIN1PPS_SIZE                           0x5
#define _CLBIN1PPS_CLBIN1PPS_LENGTH                         0x5
#define _CLBIN1PPS_CLBIN1PPS_MASK                           0x1F

// Register: CLBIN2PPS
#define CLBIN2PPS CLBIN2PPS
extern volatile unsigned char           CLBIN2PPS           __at(0x1E59);
#ifndef _LIB_BUILD
asm("CLBIN2PPS equ 01E59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN2PPS              :5;
    };
} CLBIN2PPSbits_t;
extern volatile CLBIN2PPSbits_t CLBIN2PPSbits __at(0x1E59);
// bitfield macros
#define _CLBIN2PPS_CLBIN2PPS_POSN                           0x0
#define _CLBIN2PPS_CLBIN2PPS_POSITION                       0x0
#define _CLBIN2PPS_CLBIN2PPS_SIZE                           0x5
#define _CLBIN2PPS_CLBIN2PPS_LENGTH                         0x5
#define _CLBIN2PPS_CLBIN2PPS_MASK                           0x1F

// Register: CLBIN3PPS
#define CLBIN3PPS CLBIN3PPS
extern volatile unsigned char           CLBIN3PPS           __at(0x1E5A);
#ifndef _LIB_BUILD
asm("CLBIN3PPS equ 01E5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBIN3PPS              :5;
    };
} CLBIN3PPSbits_t;
extern volatile CLBIN3PPSbits_t CLBIN3PPSbits __at(0x1E5A);
// bitfield macros
#define _CLBIN3PPS_CLBIN3PPS_POSN                           0x0
#define _CLBIN3PPS_CLBIN3PPS_POSITION                       0x0
#define _CLBIN3PPS_CLBIN3PPS_SIZE                           0x5
#define _CLBIN3PPS_CLBIN3PPS_LENGTH                         0x5
#define _CLBIN3PPS_CLBIN3PPS_MASK                           0x1F

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x1E8C);
#ifndef _LIB_BUILD
asm("ANSELA equ 01E8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELA0                :1;
        unsigned ANSELA1                :1;
        unsigned ANSELA2                :1;
        unsigned                        :1;
        unsigned ANSELA4                :1;
        unsigned ANSELA5                :1;
    };
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned                        :1;
        unsigned ANSA4                  :1;
        unsigned ANSA5                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x1E8C);
// bitfield macros
#define _ANSELA_ANSELA0_POSN                                0x0
#define _ANSELA_ANSELA0_POSITION                            0x0
#define _ANSELA_ANSELA0_SIZE                                0x1
#define _ANSELA_ANSELA0_LENGTH                              0x1
#define _ANSELA_ANSELA0_MASK                                0x1
#define _ANSELA_ANSELA1_POSN                                0x1
#define _ANSELA_ANSELA1_POSITION                            0x1
#define _ANSELA_ANSELA1_SIZE                                0x1
#define _ANSELA_ANSELA1_LENGTH                              0x1
#define _ANSELA_ANSELA1_MASK                                0x2
#define _ANSELA_ANSELA2_POSN                                0x2
#define _ANSELA_ANSELA2_POSITION                            0x2
#define _ANSELA_ANSELA2_SIZE                                0x1
#define _ANSELA_ANSELA2_LENGTH                              0x1
#define _ANSELA_ANSELA2_MASK                                0x4
#define _ANSELA_ANSELA4_POSN                                0x4
#define _ANSELA_ANSELA4_POSITION                            0x4
#define _ANSELA_ANSELA4_SIZE                                0x1
#define _ANSELA_ANSELA4_LENGTH                              0x1
#define _ANSELA_ANSELA4_MASK                                0x10
#define _ANSELA_ANSELA5_POSN                                0x5
#define _ANSELA_ANSELA5_POSITION                            0x5
#define _ANSELA_ANSELA5_SIZE                                0x1
#define _ANSELA_ANSELA5_LENGTH                              0x1
#define _ANSELA_ANSELA5_MASK                                0x20
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSA5_POSN                                  0x5
#define _ANSELA_ANSA5_POSITION                              0x5
#define _ANSELA_ANSA5_SIZE                                  0x1
#define _ANSELA_ANSA5_LENGTH                                0x1
#define _ANSELA_ANSA5_MASK                                  0x20

